[
  {
    "path": "/",
    "component": "Index",
    "description": "Landing page with hero section, features, how it works, pricing, FAQ, and CTA"
  },
  {
    "path": "/contact",
    "component": "Contact",
    "description": "Contact page with form to send messages, supports dynamic content via pageData prop"
  },
  {
    "path": "/solutions/landing-pages",
    "component": "LandingPages",
    "description": "Landing pages solution showcase with features, use cases, and conversion benefits"
  },
  {
    "path": "/solutions/corporate-websites",
    "component": "CorporateWebsites",
    "description": "Corporate websites solution showcase with enterprise features and essential pages"
  },
  {
    "path": "/solutions/ecommerce",
    "component": "Ecommerce",
    "description": "Ecommerce solution showcase explaining workflow with static pages and future WooCommerce integration"
  },
  {
    "path": "/for-who/freelancers",
    "component": "Freelancers",
    "description": "Freelancers page showing how to deliver client sites faster and scale freelance business"
  },
  {
    "path": "/for-who/agencies",
    "component": "Agencies",
    "description": "Agencies page explaining how to scale agency output without scaling costs"
  },
  {
    "path": "/for-who/entrepreneurs",
    "component": "Entrepreneurs",
    "description": "Entrepreneurs page focused on launching startups quickly and testing ideas fast"
  },
  {
    "path": "/get-help",
    "component": "GetHelp",
    "description": "Get Help page with documentation, tutorials, popular articles and support resources"
  },
  {
    "path": "/setup-account",
    "component": "PostCheckoutAccount",
    "description": "Post-checkout account setup page for WooCommerce. Creates user account and initiates plugin download after purchase. Receives pageData with orderId, userEmail, ajaxUrl, and appRedirect URL."
  },
  {
    "path": "*",
    "component": "Dynamic (via ltw-wp-adapter)",
    "description": "Catch-all route that resolves components dynamically based on WordPress globals"
  }
]
